app/controllers/analyser_controller.rb

  def index
    @players = Fixturestat.all
---
SELECT "fixturestats".* FROM "fixturestats"

  def passing
    stats = Statanalyser::Analyser.new
    player1 = Fixturestat.find(params[:player1id])
---
SELECT "fixturestats".* FROM "fixturestats" WHERE "fixturestats"."id" = ? LIMIT 1  [["id", "6"]]

  def tackling
    stats = Statanalyser::Analyser.new
    player1 = Fixturestat.find(params[:player1id])
---
SELECT "fixturestats".* FROM "fixturestats" WHERE "fixturestats"."id" = ? LIMIT 1  [["id", "15"]]

  def shooting
    stats = Statanalyser::Analyser.new
    player1 = Fixturestat.find(params[:player1id])
---
SELECT "fixturestats".* FROM "fixturestats" WHERE "fixturestats"."id" = ? LIMIT 1  [["id", "5"]]