app/controllers/clubs_controller.rb

  def index
    @profile = Profile.find_by_user_id(current_user.id)

    if @profile.nil?
      @profile = Profile.new
      @profile.user_id = current_user.id
      @profile.firstname = "joe"
      @profile.lastname = "bloggs"
      @profile.save
    end

    @clubs = Club.where('profileid' => @profile.id)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 7 LIMIT 1
INSERT INTO "profiles" ("address", "avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "firstname", "image", "lastname", "mobile", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "clubs".* FROM "clubs" WHERE "clubs"."profileid" IS NULL
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1

  def show
    @club = Club.find(params[:id])
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @user = User.find(current_user.id)
    @profile = Profile.find_by_user_id(current_user.id)
    @clubnew = params[:club]
    @clubnew[:profileid] = @profile.id
    @club = Club.new(@clubnew)

    respond_to do |format|
      if @club.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 7 LIMIT 1
INSERT INTO "clubs" ("club_type", "created_at", "image", "isOpposition", "location", "name", "profileid", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @club = Club.find(params[:id])

    respond_to do |format|
      if @club.update_attributes(params[:club])
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "clubs" SET "name" = 'Liverpool1', "updated_at" = '2013-12-20 10:49:41.800233' WHERE "clubs"."id" = 1

  def destroy
    @club = Club.find(params[:id])
    @club.destroy
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT 1  [["id", "8"]]
DELETE FROM "clubs" WHERE "clubs"."id" = ?  [["id", 8]]