app/controllers/clubs_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 2]]
---
  def create
    @user = User.find(current_user.id)
    @profile = Profile.find(@user)