app/controllers/contactus_controller.rb

INSERT INTO "contactus" ("created_at", "email", "message", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 20 Dec 2013 11:02:39 UTC +00:00], ["email", "yrs@email.dfb"], ["message", "ryks"], ["name", "ry"], ["updated_at", Fri, 20 Dec 2013 11:02:39 UTC +00:00]]
---
  def create
    @contactu = Contactu.new(params[:contactu])

    respond_to do |format|
      if @contactu.save