app/controllers/fixturestats_controller.rb

  def index
    @fixturestats = Fixturestat.all
---
SELECT "fixturestats".* FROM "fixturestats"

  def show
    @fixturestat = Fixturestat.find(params[:id])
---
SELECT "fixturestats".* FROM "fixturestats" WHERE "fixturestats"."id" = ? LIMIT 1  [["id", "5"]]

  def create
    @fixturestat = Fixturestat.new(params[:fixturestat])

    respond_to do |format|
      if @fixturestat.save
---
INSERT INTO "fixturestats" ("assists", "created_at", "fixtureid", "goals", "mins", "og", "passmissed", "passsuccess", "playerid", "rc", "shotstarget", "shotswide", "tackleslost", "tackleswon", "updated_at", "yc") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def getPlayer
    @fixturestat = Fixturestat.where('fixtureid' => params[:fixtureid], 'playerid' => params[:playerid]).first
---
SELECT "fixturestats".* FROM "fixturestats" WHERE "fixturestats"."fixtureid" = 1 AND "fixturestats"."playerid" = 2 LIMIT 1

  def getAllPlayerStats
        @fixturestats = Fixturestat.where('playerid' => params[:playerid])
---
SELECT "fixturestats".* FROM "fixturestats" WHERE "fixturestats"."playerid" = 1