app/controllers/fixtures_controller.rb

  def clubfixtures
    @fixtures = Fixture.where('clubid' => params[:id])
---
SELECT "fixtures".* FROM "fixtures" WHERE "fixtures"."clubid" = 1

  def clubfixture
    @fixtures = Fixture.find(params[:fixtureid])
---
SELECT "fixtures".* FROM "fixtures" WHERE "fixtures"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @fixture = Fixture.new(params[:fixture])

    respond_to do |format|
      if @fixture.save

        @lineup = Lineup.new
        @lineup.fixtureid = @fixture.id
        @lineup.clubid = @fixture.clubid
        @lineup.id = @fixture.id
        @lineup.save
---
INSERT INTO "fixtures" ("clubid", "created_at", "date", "home", "location", "oppid", "time", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "lineups" ("clubid", "created_at", "fixtureid", "id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["clubid", 10], ["created_at", Sun, 22 Dec 2013 21:18:43 UTC +00:00], ["fixtureid", 10], ["id", 10], ["updated_at", Sun, 22 Dec 2013 21:18:43 UTC +00:00]]

  def update
    @fixture = Fixture.find(params[:id])

    respond_to do |format|
      if @fixture.update_attributes(params[:fixture])
---
SELECT "fixtures".* FROM "fixtures" WHERE "fixtures"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "fixtures" SET "date" = '2013-09-12 00:00:00.000000', "location" = 'liverpool', "time" = '2000-01-01 06:45:00.000000', "updated_at" = '2013-12-22 14:30:57.806918' WHERE "fixtures"."id" = 1