app/controllers/gamestats_controller.rb

SELECT "gamestats".* FROM "gamestats" WHERE "gamestats"."fixtureid" = 1
---
  def getGameStats
    @gamestats = Gamestat.where('fixtureid' => params[:fixtureid])

SELECT "gamestats".* FROM "gamestats" WHERE "gamestats"."id" = ? LIMIT 1  [["id", 22]]
---
  def updategame
    @gamestats = JSON.parse(params[:clubs])

    respond_to do |format|
      @gamestats.each do |p|
        @gamestat = Gamestat.find(p["id"])

SELECT "gamestats".* FROM "gamestats" WHERE "gamestats"."clubid" = 1
---
  def getClubStats
    @gamestats = Gamestat.where('clubid' => params[:clubid])

INSERT INTO "gamestats" ("clearances", "clubid", "corners", "created_at", "crossmissed", "crosssuccess", "fixtureid", "fouls", "goals", "offsides", "passmissed", "passsuccess", "possession", "rc", "shotstarget", "shotswide", "tackleslost", "tackleswon", "updated_at", "yc") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def createMultiple
    @gamestats = JSON.parse(params[:clubs])

    respond_to do |format|
      @gamestats.each do |p|
        @gamestat = Gamestat.new
        @gamestat[:goals] = p["goals"]
        @gamestat[:passmissed] = p["passmissed"]
        @gamestat[:passsuccess] = p["passsuccess"]
        @gamestat[:rc] = p["rc"]
        @gamestat[:shotstarget] = p["shotstarget"]
        @gamestat[:shotswide] = p["shotswide"]
        @gamestat[:yc] = p["yc"]
        @gamestat[:clearances] = p["clearances"]
        @gamestat[:corners] = p["corners"]
        @gamestat[:crossmissed] = p["crossmissed"]
        @gamestat[:crosssuccess] = p["crosssuccess"]
        @gamestat[:fouls] = p["fouls"]
        @gamestat[:offsides] = p["offsides"]
        @gamestat[:possession] = p["possession"]
        @gamestat[:tackleslost] = p["tackleslost"]
        @gamestat[:tackleswon] = p["tackleswon"]
        @gamestat[:fixtureid] = p["fixtureid"]
        @gamestat[:clubid] = p["clubid"]
        @gamestat.save