app/controllers/lineupplayers_controller.rb

SELECT "lineupplayers".* FROM "lineupplayers" WHERE "lineupplayers"."lineupid" = 39
---
  def lineup
    @lineupplayers = Lineupplayer.where('lineupid' => params[:lineupid])

SELECT "lineupplayers".* FROM "lineupplayers" WHERE "lineupplayers"."lineupid" = 10 AND "lineupplayers"."playerid" = 37
---
  def getPlayer
    @lineupplayer = Lineupplayer.where('lineupid' => params[:id], 'playerid' => params[:playerid])

INSERT INTO "lineupplayers" ("captain", "created_at", "id", "lineupid", "playerid", "position", "positionid", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @lineupplayer = Lineupplayer.new(params[:lineupplayer])

    respond_to do |format|
      if @lineupplayer.save