app/controllers/lineups_controller.rb

  def getFixtureLineup
    @lineup = Lineup.where('fixtureid' => params[:fixtureid]).last
---
SELECT "lineups".* FROM "lineups" WHERE "lineups"."fixtureid" = 1 ORDER BY "lineups"."id" DESC LIMIT 1