app/controllers/logs_controller.rb

SELECT "logs".* FROM "logs"
---
  def index
    myarray = Log.all

SELECT "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT 1  [["id", "7052"]]
---
  def show
    @log = Log.find(params[:id])