app/controllers/players_controller.rb

  def clubplayers
    @players = Player.where('clubid' => params[:id])
---
SELECT "players".* FROM "players" WHERE "players"."clubid" = 1

  def show
    @player = Player.find(params[:playerid])
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "16"]]

  def create
    @player = Player.new(params[:player])

    respond_to do |format|
      if @player.save
---
INSERT INTO "players" ("clubid", "clubname", "created_at", "dob", "firstName", "height", "image", "lastName", "position", "updated_at", "weight") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @player = Player.find(params[:id])

    respond_to do |format|
      if @player.update_attributes(params[:player])
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "players" SET "firstName" = 'Kolo2', "updated_at" = '2013-12-22 14:44:41.997328' WHERE "players"."id" = 5