app/controllers/profiles_controller.rb

  def show
    @profile = Profile.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]

  def getByUserId
    @profile = Profile.find_by_user_id(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 2 LIMIT 1

  def new
    @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 7 LIMIT 1

  def edit
    @profile = Profile.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @profile = Profile.find(params[:id])

    respond_to do |format|
      if @profile.update_attributes(params[:profile])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "undefined"]]
UPDATE "profiles" SET "avatar_file_name" = 'Picture1.png', "avatar_content_type" = 'image/png', "avatar_file_size" = 99671, "avatar_updated_at" = '2013-12-14 15:52:26.577625', "updated_at" = '2013-12-14 15:52:26.580627' WHERE "profiles"."id" = 1

  def myprofile
    profile = Profile.find_by_user_id(current_user.id)

    if profile.nil?
      redirect_to "/profiles/new"
    else
      @user = User.find(current_user.id)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 2 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1

  def uploadimage
    @profile = Profile.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]